; domain
;Header and description

(define (domain robochef)

;remove requirements that are not needed
(:requirements :adl :strips :fluents :typing)


;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
(:types
    ; location
    robot - object
    cookable receptacle - locatable
    food liquid - cookable
    mug pan plate coffeeMachine - receptacle
    egg - food
    coffee water - liquid
    table - surface 
)

(:constants
    SELF - robot
)

(:predicates ;todo: define predicates here
    (is-at ?y ?x) ;true iff an object ?y is around an object ?x
    (is-visible ?x - object ?r - robot) ;true iff the object visible by the robot
    (is-held ?x - object ?r - robot) ;true iff the robot holds ?x
    ; (holding ?r) ;derived from 'is-held'
    (contains ?y - receptacle ?x) ;true iff ?x is contained in ?y
    ; (occupied ?y - receptacle) ;dervied from 'contains'
    (on ?y - surface ?x - locatable) ;true iff ?x is on top of ?y
    (is-cooked ?x - cookable) ;true iff ?x is cooked
    (is-egg-cracked ?e - egg) ;true iff ?x is cracked
    (is-coffeMachine-available ?cm - coffeeMachine) ;true iff the coffee machine is free use
)

; (:functions
;     (heat ?f - food)    
; )

;(:derived (holding ?r - SELF) ;true iff the robot is holding something
;    (exists (?x) (is-held ?x ?r))
;)

;(:derived (occupied ?y - receptacle) ;true iff a receptacle is currently used
;    (exists (?x) (contains ?y ?x))
;)


;define actions here
(:action teleport-robot
    :parameters (?src ?dest)
    :precondition (and (is-at SELF ?src) (not (is-at SELF ?dest)))
    :effect (and (not (is-at SELF ?src)) (is-at SELF ?dest))
)

(:action grab
    :parameters (?x - locatable)
    :precondition (and (is-visible ?x SELF) (is-at SELF ?x) (forall (?z) (not (is-held ?z SELF))))
    :effect (is-held ?x SELF)
)

(:action ungrab
    :parameters (?x - locatable)
    :precondition (is-held ?x SELF)
    :effect (not (is-held ?x SELF)) 
)

(:action place
    :parameters (?x - locatable ?y - surface)
    :precondition (and (is-held ?x SELF) (is-at SELF ?y))
    :effect (and (not (is-held ?x SELF)) (on ?y ?x))
)

(:action fill
    :parameters (?x - locatable ?y - receptacle)
    :precondition (and (is-held ?x SELF) (is-at SELF ?y))
    :effect (and (not (is-held ?x SELF)) (contains ?y ?x))
)

(:action make-coffee
    :parameters (?c - coffee ?m - mug ?cm - coffeeMachine)
    :precondition (and (is-visible ?cm SELF) (is-coffeMachine-available ?cm) (contains ?cm ?m))
    :effect (and (not (is-coffeMachine-available ?cm)) (contains ?m ?c))
)

(:action break-egg
    :parameters (?e - egg)
    :precondition (and (is-held ?e SELF) (not (is-egg-cracked ?e)))
    :effect (is-egg-cracked ?e)
)

(:action cook-egg
    :parameters (?e - egg ?p - pan)
    :precondition (and (is-visible ?p SELF) (is-egg-cracked ?e) (is-held ?e SELF) (forall (?z) (not (contains ?p ?z))))
    :effect (and (is-cooked ?e) (not (is-held ?e SELF)) (contains ?p ?e))
)

)

; problem
(define (problem simple_breakfast) (:domain robochef)

(:objects
    mug1 - mug
    pan1 - pan
    table1 - table
    plate1 - plate
    egg1 - egg
    cm1 - coffeeMachine
    coffee1 - coffee

    ; loc_self loc_mug loc_pan loc_table loc_plate loc_egg loc_cm - location
)

(:init ;todo: put the initial state's facts and numeric values here
    ;Setting initial locations
    ; (is-at SELF loc_self)
    ; (is-at mug1 loc_egg)
    ; (is-at pan1 loc_pan)
    ; (is-at table1 loc_table)
    ; (is-at plate1 loc_plate)
    ; (is-at egg1 loc_egg)
    ; (is-at cm1 loc_cm)

    ;Everything in the scene is visible
    (is-visible egg1 SELF)
    (is-visible coffee1 SELF)
    (is-visible mug1 SELF)
    (is-visible pan1 SELF)
    (is-visible plate1 SELF)
    (is-visible cm1 SELF)
    (is-visible table1 SELF)
    ;We assume that the exact location of the items is unknown to the robot but he can see them and reach them
    
    ;The robot is initially by the table
    (is-at SELF table1)

    (is-coffeMachine-available cm1)

)

(:goal ;todo: put the goal condition here
     (and (is-cooked egg1)
     (contains plate1 egg1)
     (contains mug1 coffee1)
     (on table1 plate1)
     (on table1 mug1)
     
     )
)

)

;un-comment the following line if metric is needed
;(:metric minimize (???))

; plan
1. (teleport-robot table1 egg1)
   deleted: (is-at self table1)
   added: (is-at self egg1)
   goals met: 0 of 5
2. (grab egg1)
   added: (is-held egg1 self)
   goals met: 0 of 5
3. (break-egg egg1)
   added: (is-egg-cracked egg1)
   goals met: 0 of 5
4. (cook-egg egg1 pan1)
   deleted: (is-held egg1 self)
   added: (is-cooked egg1) (contains pan1 egg1)
   goals met: 1 of 5
5. (grab egg1)
   added: (is-held egg1 self)
   goals met: 1 of 5
6. (teleport-robot egg1 plate1)
   deleted: (is-at self egg1)
   added: (is-at self plate1)
   goals met: 1 of 5
7. (fill egg1 plate1)
   deleted: (is-held egg1 self)
   added: (contains plate1 egg1)
   goals met: 2 of 5
8. (grab plate1)
   added: (is-held plate1 self)
   goals met: 2 of 5
9. (teleport-robot plate1 table1)
   deleted: (is-at self plate1)
   added: (is-at self table1)
   goals met: 2 of 5
10. (place plate1 table1)
   deleted: (is-held plate1 self)
   added: (on table1 plate1)
   goals met: 3 of 5
11. (teleport-robot table1 mug1)
   deleted: (is-at self table1)
   added: (is-at self mug1)
   goals met: 3 of 5
12. (grab mug1)
   added: (is-held mug1 self)
   goals met: 3 of 5
13. (teleport-robot mug1 cm1)
   deleted: (is-at self mug1)
   added: (is-at self cm1)
   goals met: 3 of 5
14. (fill mug1 cm1)
   deleted: (is-held mug1 self)
   added: (contains cm1 mug1)
   goals met: 3 of 5
15. (teleport-robot cm1 mug1)
   deleted: (is-at self cm1)
   added: (is-at self mug1)
   goals met: 3 of 5
16. (make-coffee coffee1 mug1 cm1)
   deleted: (is-coffemachine-available cm1)
   added: (contains mug1 coffee1)
   goals met: 4 of 5
17. (grab mug1)
   added: (is-held mug1 self)
   goals met: 4 of 5
18. (teleport-robot mug1 table1)
   deleted: (is-at self mug1)
   added: (is-at self table1)
   goals met: 4 of 5
19. (place mug1 table1)
   deleted: (is-held mug1 self)
   added: (on table1 mug1)
   goals met: 5 of 5
